<!DOCTYPE html>
<html>
<head>

	<title>Web del Invierno</title>
	<link rel="stylesheet" type="text/css" href="main.css">
</head>
<body>
	<div id="container">
		<header><img src="imagenes/cabecera.jpg" alt="" width="100%"></header>
		<nav>
			<a href="#">INVIERNO</a>
		</nav>

		<aside id="lateral">
			
				<h2 class="cabMenu">estacion</h2>
				
				<div id="buscar" class="divlat">
					<form>
						<input type="text" name="buscar" value="" size="12">
						<input type="image" src="imagenes/go.gif">
					</form>
				</div>
			
				<h2 class="cabMenu">registro</h2>
				
				<div class="divlat">
					<p><a href="#">Registrese con nosotros</a> y obtenga muchas ventajas.</p>
				</div>
			
				<h2 class="cabMenu">otras informaciones</h2>
			
				<div id="otras" class="divlat">
					<ul>
						<li><a href="">Quienes somos</a></li>
						<li><a href="">Nuestra misi&oacute;n</a></li>
						<li><a href="">Agenda de eventos</a></li>

					</ul>

				</div>
		</aside>

		<article>

			<h1>Titulo de la pagina</h1>
			<p>En este art&iacute;culo vamos a conocer la maquetaci&oacute;n de paginas utilizando Hojas de estilos en cascada (CSS). Veremos c&oacute;mo realizar este tipo de maquetaci&oacute;n, junto con algunas ventajas e inconvenientes. Para muchos ser&aacute; todav&iacute;a un campo por explorar. Aunque no vamos a entrar en grandes detalles, vamos a intentar dar a conocer la maquetaci&oacute;n con CSS para que cubrir la posible laguna por parte del lector. En cap&iacute;tulos sucesivos ampliaremos la informaci&oacute;n y ofreceremos tutoriales m&aacute;s pr&aacute;cticos.</p>
			
			<p>Como se ha podido aprender en el Manual de CSS, las hojas de estilo en cascada ayudan a separar el contenido de la forma, es decir, los elementos que componen una pagina de la forma con la que se muestran. Ademas, CSS ayuda en gran medida a la definici&oacute;n de estilos en la p&aacute;gina, ya que permite ajustar de una manera mucho m&aacute;s precisa cualquier aspecto de cualquier elemento de la p&aacute;gina.</p>
			
			<p>La maquetaci&oacute;n con CSS lleva la utilizaci&oacute;n de las hojas de estilo a su grado m&aacute;ximo, de manera que cualquier definici&oacute;n del aspecto de la p&aacute;gina se realiza en la declaraci&oacute;n CSS que enlazamos con el documento HTML. Para definir la situaci&oacute;n de los elementos en la p&aacute;gina se utilizan las capas, a las que se aplica un posicionamiento a trav&eacute;s tambi&eacute;n de las hojas de estilo.</p>
			
			<p>Para crear las capas se utilizan etiquetas &lt;DIV&gt;, en las que se introducen los elementos que queramos que aparezcan en la p&aacute;gina. Los elementos dentro de los &lt;DIV&gt; tambi&eacute;n se pueden anidar, para heredar las propiedades y posicionamiento de las capas padre.</p>
			
			<p>En la maquetaci&oacute;n por capas se definen &uacute;nicamente etiquetas &lt;DIV&gt; y las tablas s&oacute;lo se utilizan para mostrar informaci&oacute;n tabulada, es decir, mostrada en filas y columnas. Cabe se&ntilde;alar que en la maquetaci&oacute;n tradicional se utilizan las tablas para ajustar la posici&oacute;n.</p>
		</article>
		<footer>
			<a href="#">Volver</a>  |  <a href="#">Portada</a>  | <a href="#">Mapa del sitio</a>
		</footer>
	</div>

</body>
</html>